var express = require('express');
var router = express.Router();

/* Get user`s lesson */
router.get('/pompon', function(req, res, next) {
  res.render('13_stories/pompon_monster', 
    { 
      title: 'Балабоновий монстр', 
      story_name: 'Історія балабонового монстра  \ (вивчаємо цикли)',
      boy_talent: 'Хлопчик може:',
      boy_action: 'Відгризти балабон',
      mom_talent: 'Мама може:',
      mom_action: 'Пришити балабон',
      your_talent: 'Ти можеш:',
      your_action: 'Читати цю історію далі!',
      pompon_color: 'Шапка Левка:',
      greetings: 'Яма з балабонами',
      story_items: [
        'Якось одному хлопчикові на ім’я Левко Тигренко мама \
        сплела синю вовняну шапку з балабоном. \
        Левку не подобався балабон, але мама не погоджувалася \
        відрізати його від шапки. \
        Тому хлопчик пішов до школи у новій шапці, але дорогою \
        ВІДГРИЗ балабон і викинув у яму. \
        А мамі вдома сказав, що балабон загубився.',
        
        'Але мама ПРИШИЛА до шапки новий балабон, червоний!',
        
        'Наступного ранку Левко знову пішов до школи, \
        дорогою знову ВІДГРИЗ балабон і знову кинув у яму при дорозі.\
        А мамі сказав, буцім балабон загубився.',
      
        'Однак мама ПРИШИЛА до шапки новий балабон, зелений!',
        
        'Наступного ранку Левко знову пішов до школи,\
        дорогою знову ВІДГРИЗ балабон і знову викинув у яму при дорозі. \
        А мамі знову сказав, ніби балабон загубився!',
      
        'Та  мама ПРИШИЛА до шапки новий балабон, жовтий!',
        
        'Наступного ранку Левко знову пішов до школи,\
        дорогою знову ВІДГРИЗ балабон і знову викинув у яму при дорозі.',
        
        'Раптом чотири балабони об’єдналися у ямі, \
        і з них постав величезний БАЛАБОНОВИЙ МОНСТР! \
        Він швидко виріс і ПОГЛИНУВ хлопчика у синій шапці, \
        і школу, і дорогу, і все місто, і всю нашу планету заразом.'
      ],
      monster_talent: 'Монстр може:',
      monster_action: 'Поглинути весь світ',
      monster_danger: 'Рівень небезпеки:',
    }
  );
});

router.get('/pompon/how-its-made', function(req, res, next) {
  res.render('13_stories/pompon_how_its_made', 
    {
      title: 'Як зроблена історія про балабонового монстра?',
      heroes_can: 'Пригадаємо, що вміють персонажі:',
      monster_talent: 'Балабоновий Монстр',
      monster_action: 'утворюється з чотирьох балабонів і поглинає весь світ',
      boy_talent: 'Левко',
      boy_action: 'уміє відгризти балабон',
      mom_talent: 'Мама',
      mom_action: 'уміє пришити балабон',
      your_talent: 'Ти можеш',
      your_action: 'Написати історію з циклом',
      about_this_story: 'Аби написати історію про монстра, Галина Ткачук\
        скористалася циклом -- повторенням подібних подій із несподіваним завершенням.',
      explanation_1: 
        'Мама та син пришивають та відривають балабони кілька разів.\
        Такі послідовності називають "циклами".',
      explanation_2:
        'Балабоновий монстр з\'являється, коли разом збираються чотири балабони. \
        Цикл завершується, коли Балабоновий монстр пожирає весь світ. \.',
      explanation_3:
        'Кожен цикл повинен мати умову його завершення. Інакше цикл триватиме нескінченно довго!',
      select_heroes_link: '/practice/heroes'
    }
  );
});

module.exports = router;